
x = int(input("Введите высоту фигуры : "))
# while 1 == 1:
#     choice = int(input('Выберите из списка :\n'
#             'Нарисовать пустой, равнобедренный треугольник [ Введите 1 ]\n'
#             'Нарисовать закрашенный, равнобедренный треугольник [ Введите 2 ]\n'
#             'Нарисовать полу закрашенный ромб [ Введите 3 ]\n'
#             'Нарисовать полу закрашенный ромб на палочке [ Введите 4 ]\n'
#             'Выйти [ Q ]'))
#    if (choice == 1 or choice == 2):
for i in range(x):
    for j in range(x):
        print("--")
    print("--")
